#pragma once

#include <string>

//==============================================================
// 敵のデータ
//==============================================================
struct EnemyData
{
    int id;             // 敵ID
    std::string name;   // 敵の名前
    int hp;             // 敵のHP
    int attack;         // 敵の攻撃力
};

//==============================================================
// 敵データテーブル
//==============================================================
 const EnemyData enemyTable[] =
{
    { 0, "スライム", 30, 5 },
    { 1, "ゴブリン", 50, 10 },
    { 2, "ドラゴン", 100, 20 }
};

// 敵の種類数を自動で求める
const int ENEMY_DATA_SIZE =
sizeof(enemyTable) / sizeof(enemyTable[0]);
