#include <iostream>
#include "Player.h"

using namespace std;

//==============================================================
// コンストラクタ
//==============================================================
Player::Player()
    : hp(MAX_HP),
    attack(20)
{
}

//==============================================================
// 敵を攻撃する
//==============================================================
void Player::AttackEnemy(Enemy* enemy)
{
    if (enemy == nullptr || !enemy->IsAlive())
    {
        return;
    }

    cout << "勇者の攻撃！" << endl;
    cout << enemy->GetName()
        << "に"
        << attack
        << "ダメージ！"
        << endl;

    enemy->Damage(attack);
}

//==============================================================
// ダメージを受ける
//==============================================================
void Player::Damage(int damage)
{
    if (damage < 0)
    {
        return;
    }

    hp -= damage;

    if (hp < 0)
    {
        hp = 0;
    }

    cout << "勇者は"
        << damage
        << "ダメージ受けた！"
        << endl;
}

//==============================================================
// 回復
//==============================================================
void Player::Heal(int amount)
{
    if (amount <= 0)
    {
        return;
    }

    hp += amount;
    if (hp > MAX_HP)
    {
        hp = MAX_HP;
    }

    cout << "勇者は"
        << amount
        << "回復した！ 現在 HP : "
        << hp
        << endl;
}

//==============================================================
// 生存確認
//==============================================================
bool Player::IsAlive() const
{
    return hp > 0;
}

//==============================================================
// HP取得
//==============================================================
int Player::GetHP() const
{
    return hp;
}